-- phpMyAdmin SQL Dump
-- version 4.9.7
-- https://www.phpmyadmin.net/
--
-- Host: localhost:8889
-- 생성 시간: 21-05-22 13:09
-- 서버 버전: 5.7.32
-- PHP 버전: 7.4.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

--
-- 데이터베이스: `hm`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `parkinglot`
--

CREATE TABLE `parkinglot` (
  `name` varchar(40) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `total_space` int(10) NOT NULL,
  `full_space` int(10) NOT NULL,
  `empty_space` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `parkinglot`
--

INSERT INTO `parkinglot` (`name`, `x`, `y`, `total_space`, `full_space`, `empty_space`) VALUES
('4동8호공원 주차장', 37.2944, 126.822, 10, 7, 3),
('705유료주차장', 37.314, 126.829, 12, 7, 5),
('NC백화점 고잔점 주차장', 37.3139, 126.831, 80, 50, 30),
('거주자 우선 주차(유료)1', 37.2475, 127.015, 35, 30, 5),
('거주자 우선 주차(유료)2', 37.2473, 127.016, 30, 20, 10),
('거주자 우선 주차(유료)3', 37.2467, 127.016, 10, 0, 10),
('경기테크노파크 주차장', 37.2901, 126.829, 70, 22, 48),
('공영유료주차장', 37.3017, 126.863, 9, 9, 0),
('디엠주차장', 37.307, 126.851, 20, 5, 15),
('명품주차장', 37.3127, 126.829, 18, 10, 8),
('미래주차장', 37.3072, 126.851, 20, 10, 10),
('미영아파트 주차장', 37.2475, 127.015, 50, 45, 5),
('본오주공아파트앞주차장', 37.3021, 126.861, 6, 3, 3),
('본오지구대옆공영주차장', 37.3031, 126.861, 12, 12, 0),
('사동 117호 공영주차장', 37.2957, 126.855, 4, 4, 0),
('사동 47호 공영주차장', 37.2987, 126.85, 40, 10, 30),
('사동 8호공원 주차장', 37.2944, 126.822, 16, 8, 8),
('삼리로주차장', 37.3052, 26.8453, 15, 0, 15),
('상록구청주차장', 37.3003, 126.846, 30, 10, 20),
('성포공원내공영주차장', 37.3018, 126.846, 8, 3, 5),
('세류 고가 3주차장', 37.2504, 127.018, 30, 20, 10),
('수영주차장', 37.2967, 126.863, 20, 5, 15),
('아이프라자빌딩주차장', 37.2944, 126.859, 10, 1, 9),
('안산시공영유료주차장', 37.3144, 126.829, 15, 5, 10),
('안산호수공원 주차장1', 37.2979, 126.823, 50, 8, 42),
('안산호수공원 주차장2', 37.3011, 126.828, 40, 12, 28),
('안산호수공원 주차장3', 37.2979, 126.829, 45, 14, 31),
('안산호수공원 주차장4', 37.3028, 126.83, 50, 6, 44),
('여원주차장', 37.2955, 126.854, 50, 1, 50),
('월드주차장', 37.3143, 126.828, 10, 5, 5),
('장은타워 주차장', 37.313, 126.829, 10, 7, 3),
('장은타워관리단 운영위원회', 37.3133, 126.829, 30, 10, 20),
('제 12호 자투리 주차장', 37.248, 127.015, 5, 4, 1),
('중앙주차장', 37.3078, 126.85, 40, 2, 38),
('진흥5길신촌길 노상공영주차장', 37.3128, 126.828, 8, 8, 0),
('한국산업기술시험원 경기분원 주차장', 37.2919, 126.832, 20, 12, 8),
('한양대학교 주차장1', 37.2943, 126.831, 30, 25, 5),
('한양대학교 주차장2', 37.2961, 126.835, 10, 0, 10),
('한양대학교 주차장3', 37.2932, 126.836, 30, 10, 20),
('한양대학교 주차장4', 37.2972, 126.838, 10, 10, 0),
('한양대학교 주차장5', 37.2979, 126.838, 30, 25, 5),
('한양대학교 주차장6', 37.2993, 126.838, 10, 0, 10),
('한양대학교 주차장7', 37.2965, 126.842, 30, 10, 20),
('해양동행정복지센터 주차장', 37.2947, 126.82, 6, 2, 4),
('현대주차장', 37.3086, 126.85, 18, 8, 10),
('화랑주차타워 유료주차장', 37.3143, 126.828, 20, 18, 2);

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `parkinglot`
--
ALTER TABLE `parkinglot`
  ADD PRIMARY KEY (`name`,`x`,`y`,`total_space`,`full_space`,`empty_space`);
