-- phpMyAdmin SQL Dump
-- version 4.9.7
-- https://www.phpmyadmin.net/
--
-- Host: localhost:8889
-- 생성 시간: 21-05-18 14:56
-- 서버 버전: 5.7.32
-- PHP 버전: 7.4.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

--
-- 데이터베이스: `hm`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `parkinglot`
--

CREATE TABLE `parkinglot` (
  `name` varchar(40) NOT NULL,
  `x` double NOT NULL,
  `y` double NOT NULL,
  `total_space` int(10) NOT NULL,
  `full_space` int(10) NOT NULL,
  `empty_space` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `parkinglot`
--

INSERT INTO `parkinglot` (`name`, `x`, `y`, `total_space`, `full_space`, `empty_space`) VALUES
('세류 고가 3주차장', 37.25040007017113, 127.0177019705559, 30, 20, 10),
('제 12호 자투리 주차장', 37.24804865875466, 127.01545563379784, 5, 4, 1),
('거주자 우선 주차(유료)1', 37.24754865875466, 127.01545563379784, 35, 30, 5),
('미영아파트 주차장', 37.24754865875466, 127.01458593379785, 50, 45, 5),
('거주자 우선 주차(유료)2', 37.247293986252004, 127.01581615448784, 30, 20, 10),
('거주자 우선 주차(유료)3', 37.24672403557383, 127.0161118992067, 10, 0, 10),
('한양대학교 주차장1', 37.29426573238396, 126.83147717269108, 30, 10, 20),
('한양대학교 주차장2', 37.296057425273325, 126.83530499416962, 10, 0, 10),
('한양대학교 주차장3', 37.29319370562554, 126.83644184853115, 30, 10, 20),
('한양대학교 주차장4', 37.2972307337403, 126.8383617353502, 10, 0, 10),
('한양대학교 주차장5', 37.2978835512855, 126.83804453707344, 30, 10, 20),
('한양대학교 주차장6', 37.29937902716941, 126.83786650853243, 10, 0, 10),
('한양대학교 주차장7', 37.29654019433495, 126.84244882057581, 30, 10, 20),
('안산교통정보센터주차장', 37.29654019433495, 126.84244882057581, 10, 0, 10),
('상록구청주차장', 37.300250220584346, 126.84587834962909, 30, 10, 20);
